PinkFluffyUnic0rn/stm32flight/main.c
	// two bits used to maintain space between packets
	buf[16] = 0;
	buf[17] = 0;
}

inline int dshotsetthrust(uint16_t *buf, float v)
{
	// convert motor thrust value from [0.0;1.0]
	// range to int value in [48; 2047] range
	// disable telemetry request bit
	dshotsetbuf(buf, (uint16_t) (trimuf(v) * 1999.0 + 0.5) + 48, 0);

	return 0;
}

// Send dshot special command to a DSHOT output.
//
// n -- a DSHOT output's number.
// cmd -- command number.
int dshotcmd(int n, uint16_t cmd)
{
	static uint16_t dsbuf[18];
	DMA_HandleTypeDef *hdma;
	int timcc;
	volatile uint32_t *ccr;
	int i;

	// select DMA device, TIM channel and CCR
	// register corresponding to the DSHOT output
	switch (n) {
	case 0:
		hdma = htim1.hdma[TIM_DMA_ID_CC1];
		timcc = TIM_DMA_CC1;
		ccr = &(htim1.Instance->CCR1);
		break;

	case 1:
		hdma = htim1.hdma[TIM_DMA_ID_CC2];
		timcc = TIM_DMA_CC2;
		ccr = &(htim1.Instance->CCR2);
		break;

	case 2:
		hdma = htim1.hdma[TIM_DMA_ID_CC3];
		timcc = TIM_DMA_CC3;
		ccr = &(htim1.Instance->CCR3);
		break;

	case 3:
		hdma = htim1.hdma[TIM_DMA_ID_CC4];
		timcc = TIM_DMA_CC4;
		ccr = &(htim1.Instance->CCR4);
		break;

	default:
		return 0;
	}

	// construst a PWM duty cycle buffer for dshot ESC
	dshotsetbuf(dsbuf, cmd, 1);

	// wait for previous DSHOT packet to finish
	udelay(100);

	// send packet with command 10 times. Specification
	// requires 6 for most command, 10 is to be sure.
	for (i = 0; i < 10; ++i) {
		// instruct DMA to use the buffer
		// for stream corresponding to DSHOT output
		HAL_DMA_Start_IT(hdma, (uint32_t) dsbuf,
			(uint32_t) ccr, 18);

		// Enable DMA for stream corresponding to DSHOT output
		__HAL_TIM_ENABLE_DMA(&htim1, timcc);

		// wait for previous command packet to finish
		udelay(100);
	}

	return 0;
}

/* Set motors thrust

      ltd    rtd
        \    /
   p     \  /
   |
   v     /  \
        /    \
      lbd    rbd

         <- r
*/
// all values should be between 0.0 and 1.0.
int setthrust(float ltd, float rtd, float lbd, float rbd)
{
	static uint16_t dsbuf[4][18];

	if (isnan(ltd) || isnan(rtd) || isnan(rbd)
		|| isnan(lbd) || !elrs)
		ltd = rtd = rbd = lbd = 0.0;

	// put motors thrust values into log
	logwrite(LOG_LT, ltd);
	logwrite(LOG_LB, lbd);
	logwrite(LOG_RB, rbd);
	logwrite(LOG_RT, rtd);

	if (st.lt < 0 || st.lt > 3 || st.lb < 0 || st.lb > 3
			|| st.rb < 0 || st.rb > 3
			|| st.rt < 0 || st.rt > 3)
		return 0;

	// construst a PWM duty cycle
	// buffers for dshot ESCs
	dshotsetthrust(dsbuf[st.lt], ltd);
	dshotsetthrust(dsbuf[st.lb], lbd);
	dshotsetthrust(dsbuf[st.rt], rtd);
	dshotsetthrust(dsbuf[st.rb], rbd);

	// instruct DMA to use the buffers
	// for streams corresponding to DSHOT ESCs
	HAL_DMA_Start_IT(htim1.hdma[TIM_DMA_ID_CC1],
		(uint32_t) dsbuf[0],
		(uint32_t) &(htim1.Instance->CCR1), 18);
	HAL_DMA_Start_IT(htim1.hdma[TIM_DMA_ID_CC2],
		(uint32_t) dsbuf[1],
		(uint32_t) &(htim1.Instance->CCR2), 18);
	HAL_DMA_Start_IT(htim1.hdma[TIM_DMA_ID_CC3],
		(uint32_t) dsbuf[2],
		(uint32_t) &(htim1.Instance->CCR3), 18);
	HAL_DMA_Start_IT(htim1.hdma[TIM_DMA_ID_CC4],
		(uint32_t) dsbuf[3],
		(uint32_t) &(htim1.Instance->CCR4), 18);

	// Enable DMA for streams corresponding to DSHOT ESCs
	__HAL_TIM_ENABLE_DMA(&htim1, TIM_DMA_CC1);
	__HAL_TIM_ENABLE_DMA(&htim1, TIM_DMA_CC2);
	__HAL_TIM_ENABLE_DMA(&htim1, TIM_DMA_CC3);
	__HAL_TIM_ENABLE_DMA(&htim1, TIM_DMA_CC4);

	return 0;
}

// Init ESC's.
static void esc_init()
{
	__HAL_TIM_SET_AUTORELOAD(&htim1, DSHOT_BITLEN);

	// set dshot DMA callback for TIM channels
	// corresponding to DSHOT escs
	htim1.hdma[TIM_DMA_ID_CC1]->XferCpltCallback = dshotdmacb;
	htim1.hdma[TIM_DMA_ID_CC2]->XferCpltCallback = dshotdmacb;
	htim1.hdma[TIM_DMA_ID_CC3]->XferCpltCallback = dshotdmacb;
	htim1.hdma[TIM_DMA_ID_CC4]->XferCpltCallback = dshotdmacb;

	// start PWM on TIM channels corresponding to DSHOT ESCs
  	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
  	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);

	// set zero initial thrust for every motor
	setthrust(0.0, 0.0, 0.0, 0.0);
}

// Init HP206c barometer.
static void hp_init()
{
	struct hp_device d;

	d.hi2c = &hi2c1;
	d.osr = HP_OSR_512;

	if (hp_initdevice(&d, dev + HP_DEV) >= 0)
		uartprintf("HP206C initilized\r\n");
	else
		uartprintf("failed to initilize HP206C\r\n");
}

// Init IRC tramp video transmitter.
static void irc_init()
{
	struct irc_device d;

	d.huart = &huart5;
	d.power = st.ircpower;
	d.frequency = st.ircfreq;

	if (irc_initdevice(&d, dev + IRC_DEV) >= 0)
		uartprintf("IRC device initilized\r\n");
	else
		uartprintf("failed to initilize IRC device\r\n");
}

// Init ICM-42688-P IMU.
static void icm_init()
{
	struct icm_device d;

	d.hspi = &hspi1;
	d.gpio = GPIOC;
	d.pin = GPIO_PIN_13;

	d.gyroscale = ICM_1000DPS;
	d.gyrorate = ICM_GYRO8K;
	d.gyroorder = ICM_GYROORDER3;
	d.gyrolpf = ICM_GYROLPFLL;
	d.accelscale = ICM_4G;
	d.accelrate = ICM_ACCEL8K;
	d.accellpf = ICM_ACCELLPFLL;
	d.accelorder = ICM_ACCELORDER3;

	if (icm_initdevice(&d, dev + ICM_DEV) >= 0)
		uartprintf("ICM-42688 initilized\r\n");
	else
		uartprintf("failed to initilize ICM-42688\r\n");
}

// Init QMC5883L magnetometer.
static void qmc_init()
{
	struct qmc_device d;

	d.hi2c = &hi2c1;
	d.scale = QMC_SCALE_8;
	d.rate = QMC_RATE_100;
	d.osr = QMC_OSR_512;

	if (qmc_initdevice(&d, dev + QMC_DEV) >= 0)
		uartprintf("QMC5883L initilized\r\n");
	else
		uartprintf("failed to initilize QMC5883L\r\n");
}

// Init ESP8285.
static void espdev_init()
{
	struct esp_device d;

	d.hspi = &hspi2;
	d.csgpio = GPIOC;
	d.cspin = GPIO_PIN_0;
	d.rstgpio = GPIOC;
	d.rstpin = GPIO_PIN_14;
	d.bootgpio = GPIOC;
	d.bootpin = GPIO_PIN_15;
	d.intpin = GPIO_PIN_1;

	if (esp_initdevice(&d, dev + ESP_DEV) < 0) {
		uartprintf("failed to initilize ESP8266\r\n");
		return;
	}

	uartprintf("ESP8266 initilized\r\n");
}

